package java_0622;
//API(Application Programming Interface) 는 애플리케이션 소프트웨어를 구축하고
/*통합하기 위한 정의 및 프로토콜 세트로 애플리케이션 프로그래밍 인터페이스를 나타낸다
 * api를 사용하면 구현 방식을 알지 못해도 제품 또는 서비스가 서로 커뮤니케이션할 수 있으며
 * 애플리케이션 개발을 간소화하여 시간과 비용을 절약할 수 있다. 
 *새로운 틀과 제품을 설계하거나 기존 틀과 제품을 관리하는 경우
 *api 는 유연성을 제공하고 설계, 관리, 사용 방법을 간소화하며 혁신의 기회를 제공한다
 *
 URL은 인터넷에 존재하는 여러 서버들이 제공하는 자원에 접근할 수 있는 
 주소를 표현하기 위한 것으로
 프로토콜이름 : //호스트명 : 포트번호/경로명/파일명? 쿼리스트링#참조 형으로 이뤄져있다. 
 
 https://www.codechobo.com:80/samle/hello.html?referrer=codechobo#ubdex1
 
 프로토콜 : 자원에 접근하기 위해 서버와 통신하는데 사용되는 통신규약(http)
 호스트명 : 자원을 제공하는 서버의 이름(www.codechobo.com)
 포트번호 : 통신에 사용되는 서버의 포트 번호 (80)
 경로명 : 접근하려는 자원이 저장된 서버상의 위치(/sample/)
 파일명 : 접근하려는 자원의 이름(hello.html)
 쿼리 (query) : URL에서 '?' 이후의 부분(referrer = codechobo)
 참조 (anchor) : URL에서 '#' 이후의 부분(index1)
 
 */

